In [14]:
import json
import pandas as pd

with open("../data/raw/match_details/all_match_details01.json", "r") as f:
    match_data = json.load(f)

# Convert the list of matches to a DataFrame
df = pd.DataFrame(match_data)

df.head()

,matchId,gameDuration,championId,championName,teamId,individualPosition,kills,deaths,assists,win,...,item_1,item_purchase_time_1,item_2,item_purchase_time_2,item_3,item_purchase_time_3,item_4,item_purchase_time_4,item_5,item_purchase_time_5
0,NA1_5159373690,2405,24,Jax,100,TOP,7,6,10,True,...,6610,1149,2504,1901,3078,676,3053,1442,3026,2322
1,NA1_5159373690,2405,30,Karthus,100,JUNGLE,16,13,12,True,...,2503,545,3020,1930,3118,1443,3135,1759,4645,1078
2,NA1_5159373690,2405,91,Talon,100,MIDDLE,22,14,16,True,...,6698,1848,3142,584,6697,2380,3814,1636,6695,826
3,NA1_5159373690,2405,22,Ashe,100,BOTTOM,2,10,11,True,...,6672,1101,3046,1709,3006,759,3033,2166,1037,2299
4,NA1_5159373690,2405,432,Bard,100,UTILITY,4,6,27,True,...,3084,810,3876,Unknown Time,3107,1980,3009,540,3916,2162

In [16]:
df['championName'].value_counts()

championName
Caitlyn         213
Graves          178
Jhin            172
Viego           158
Jinx            158
               ...
Trundle          16
Heimerdinger     15
Rammus           14
Annie            12
Quinn             9
Name: count, Length: 169, dtype: int64